Advanced_Cases/Cylinder/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       12135;
    }
    inlet
    {
        type            patch;
        nFaces          70;
        startFace       12175;
    }
    outlet
    {
        type            patch;
        nFaces          70;
        startFace       12245;
    }
    topAndBottom
    {
        type            patch;
        nFaces          150;
        startFace       12315;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12300;
        startFace       12465;
    }
)

// ************************************************************************* //
