Advanced_Cases/Cylinder/cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-2 -2.0 0)			// 0 //Back Face
    (-0.1060660172 -2.0 0)		// 1
    (-0.1060660172 -0.1060660172 0)	// 2
    (-2 -0.1060660172 0)		// 3
    (0.1060660172 -2.0 0)		// 4
    (5.0 -2.0 0)			// 5
    (5.0 -0.1060660172 0)		// 6
    (0.1060660172 -0.1060660172 0)	// 7
    (0.1060660172 0.1060660172 0)	// 8
    (5.0 0.1060660172 0)		// 9
    (5.0 2.0 0)				// 10
    (0.1060660172 2.0 0)		// 11
    (-2 0.1060660172 0)		// 12
    (-0.1060660172 0.1060660172 0)	// 13
    (-0.1060660172 2.0 0)		// 14
    (-2 2.0 0)			// 15
    (-2 0 0)				// 16
    (-0.15 0 0)				// 17
    (0.15 0 0)				// 18
    (5.0 0 0)				// 19
    (-0.05 0 0)				// 20
    (-0.0353553391 -0.0353553391 0)	// 21
    (0.0353553391 -0.0353553391 0)	// 22
    (0.05 0 0)				// 23
    (0.0353553391 0.0353553391 0)	// 24
    (-0.0353553391 0.0353553391 0)	// 25
    (-2 -2.0 0.01)			// 26 //Front Face
    (-0.1060660172 -2.0 0.01)		// 27
    (-0.1060660172 -0.1060660172 0.01)	// 28
    (-2 -0.1060660172 0.01)		// 29
    (0.1060660172 -2.0 0.01)		// 30
    (5.0 -2.0 0.01)			// 31
    (5.0 -0.1060660172 0.01)		// 32
    (0.1060660172 -0.1060660172 0.01)	// 33
    (0.1060660172 0.1060660172 0.01)	// 34
    (5.0 0.1060660172 0.01)		// 35
    (5.0 2.0 0.01)			// 36
    (0.1060660172 2.0 0.01)		// 37
    (-2 0.1060660172 0.01)		// 38
    (-0.1060660172 0.1060660172 0.01)	// 39
    (-0.1060660172 2.0 0.01)		// 40
    (-2 2.0 0.01)			// 41
    (-2 0 0.01)			// 42
    (-0.15 0 0.01)			// 43
    (0.15 0 0.01)			// 44
    (5.0 0 0.01)			// 45
    (-0.05 0 0.01)			// 46
    (-0.0353553391 -0.0353553391 0.01)	// 47
    (0.0353553391 -0.0353553391 0.01)	// 48
    (0.05 0 0.01)			// 49
    (0.0353553391 0.0353553391 0.01)	// 50
    (-0.0353553391 0.0353553391 0.01)	// 51
 
);

blocks          
(
    hex (0 1 2 3 26 27 28 29)     (20 30 1)   simpleGrading (0.08 0.1 1)
    hex (1 4 7 2 27 30 33 28)     (10 30 1)   simpleGrading (1 0.1 1)
    hex (4 5 6 7 30 31 32 33)     (45 30 1)  simpleGrading (20 0.1 1)
    hex (7 6 19 18 33 32 45 44)   (45  5 1)  simpleGrading (20 1 1)
    hex (18 19 9 8 44 45 35 34)   (45  5 1)  simpleGrading (20 1 1)
    hex (8 9 10 11 34 35 36 37)   (45 30 1)  simpleGrading (20 10 1)
    hex (13 8 11 14 39 34 37 40)  (10 30 1)   simpleGrading (1 10 1)
    hex (12 13 14 15 38 39 40 41) (20 30 1)   simpleGrading (0.08 10 1)
    hex (16 17 13 12 42 43 39 38) (20  5 1)   simpleGrading (0.08 1 1)
    hex (3 2 17 16 29 28 43 42)   (20  5 1)   simpleGrading (0.08 1 1)
    hex (2 7 22 21 28 33 48 47)   (10 25 1)  simpleGrading (1 0.03 1)
    hex (7 18 23 22 33 44 49 48)  ( 5 25 1)  simpleGrading (1 0.03 1)
    hex (18 8 24 23 44 34 50 49)  ( 5 25 1)  simpleGrading (1 0.03 1)
    hex (8 13 25 24 34 39 51 50)  (10 25 1)  simpleGrading (1 0.03 1)
    hex (13 17 20 25 39 43 46 51) ( 5 25 1)  simpleGrading (1 0.03 1)
    hex (17 2 21 20 43 28 47 46)  ( 5 25 1)  simpleGrading (1 0.03 1)
);

edges           
(
    arc 2 7   (0 -0.15 0)
    arc 7 18  (0.1385829299 -0.0574025149 0)
    arc 18 8  (0.1385829299 0.0574025149 0)
    arc 8 13  (0 0.15 0)
    arc 13 17 (-0.1385819299 0.0574025149 0)
    arc 17 2  (-0.1385819299 -0.0574025149 0)
    arc 20 21 (-0.0461939766 -0.0191341716 0)
    arc 21 22 (0 -0.05 0)
    arc 22 23 (0.0461939766 -0.0191341716 0)
    arc 23 24 (0.0461939766 0.0191341716 0)
    arc 24 25 (0 0.05 0)
    arc 25 20 (-0.0461939766 0.0191341716 0)
    arc 28 33 (0 -0.15 0.01)
    arc 33 44 (0.1385829299 -0.0574025149 0.01)
    arc 44 34 (0.1385829299 0.0574025149 0.01)
    arc 34 39 (0 0.15 0.01)
    arc 39 43 (-0.1385819299 0.0574025149 0.01)
    arc 43 28 (-0.1385819299 -0.0574025149 0.01)
    arc 46 47 (-0.0461939766 -0.0191341716 0.01)
    arc 47 48 (0 -0.05 0.01)
    arc 48 49 (0.0461939766 -0.0191341716 0.01)
    arc 49 50 (0.0461939766 0.0191341716 0.01)
    arc 50 51 (0 0.05 0.01)
    arc 51 46 (-0.0461939766 0.0191341716 0.01)
);

patches         
(
    wall fixedWalls	//Cylinder Walls
    (
        (21 20 46 47)
	(22 21 47 48)
	(23 22 48 49)
	(24 23 49 50)
	(25 24 50 51)
	(20 25 51 46)
    )
    patch inlet		// Inlet Faces	
    (
        (15 12 38 41)
	(12 16 42 38)
	(16 3 29 42)
	(3 0 26 29)
    )
    patch outlet	// Outlet Faces
    (
        (9 10 36 35)
	(19 9 35 45)
	(6 19 45 32)
	(5 6 32 31)
    )
    patch topAndBottom	// Top & Bottom of grid
    (
	(14 15 41 40)
	(11 14 40 37)
	(10 11 37 36)
	(0 1 27 26)
	(1 4 30 27)
	(4 5 31 30)
    )
    empty frontAndBack	// Front & Back faces
    (
	(0 3 2 1)
	(1 2 7 4)
	(4 7 6 5)
	(7 18 19 6)
	(18 8 9 19)
	(8 11 10 9)
	(13 14 11 8)
	(12 15 14 13)
	(12 13 17 16)
	(2 3 16 17)
	(7 2 21 22)
	(7 22 23 18)
	(8 18 23 24)
	(8 24 25 13)
	(13 25 20 17)
	(2 17 20 21)
	(26 27 28 29)
	(27 30 33 28)
	(30 31 32 33)
	(33 32 45 44)
	(44 45 35 34)
	(34 35 36 37)
	(34 37 40 39)
	(38 39 40 41)
	(42 43 39 38)
	(29 28 43 42)
	(28 33 48 47)
	(33 44 49 48)
	(44 34 50 49)
	(34 39 51 50)
	(39 43 46 51)
	(43 28 47 46)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
